Revit 2024 API
BuiltInFailures.StairRampFailures.StairsActualRiserHeightGreaterThanMaximumFailure Property
 Computed actual riser height of stairs is greater than maximum riser height defined in stairs type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId StairsActualRiserHeightGreaterThanMaximumFailure { get; }
Visual Basic
Public Shared ReadOnly Property StairsActualRiserHeightGreaterThanMaximumFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ StairsActualRiserHeightGreaterThanMaximumFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace